# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]
import math
arr = [2, -5, 8, 9, -25, 25, 4]
arr_new = []

for a in arr:
    if a > 0 and math.sqrt(a).is_integer():
        arr_new.append(round(math.sqrt(a)))
print('Задание 1')
print('Исходный список: ', arr, '\n Новый список: ', arr_new)
print()

# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

day = {'01': 'первое', '02': 'второе', '03': 'третье',
       '04': 'четвёртое', '05': 'пятое', '06': 'шестое',
       '07': 'седьмое', '08': 'восьмое', '09': 'девятое',
       '10': 'десятое', '11': 'одиннадцатое', '12': 'двенадцатое',
       '13': 'тринадцатое', '14': 'четырнадцатое', '15': 'пятнадцатое',
       '16': 'шестнадцатое', '17': 'семнадцатое', '18': 'восемнадцатое',
       '19': 'девятнадцатое', '20': 'двадцатое', '21': 'двадцать первое',
       '22': 'двадцать второе', '23': 'двадцать третье', '24': 'двадцать четвёртое',
       '25': 'двадцать пятое', '26': 'двадцать шестое', '27': 'двадцать седьмое',
       '28': 'двадцать восьмое', '29': 'двадцать девятое', '30': 'тридцатое',
       '31': 'тридцать первое'}

months = {'01': 'января', '02': 'февраля', '03': 'марта',
          '04': 'апреля', '05': 'мая', '06': 'июня',
          '07': 'июля', '08': 'августа', '09': 'сентября',
          '10': 'октября', '11': 'ноября', '12': 'декабря'}

print('Задание 2')
dateInput = input('Введите дату формате dd.mm.yyyy:\n').split('.')
print(day[dateInput[0]] + ' ' + months[dateInput[1]] + ' ' + dateInput[2] + ' ' + 'года')
print()
# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random
import random
print('Задание 3')
n = int(input('Введите количество элементов списка \n'))
lst = []

for i in range(n):
    lst.append(random.randint(-100,100))

print('Сформированный список: ', lst)
print()

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут:
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst2 = []
lst3 = set(lst)

for i in lst:
    if lst.count(i) > 1:
        continue
    else:
        lst2.append(i)
print('Задание 4')
print('Исходный список: ', lst, '\n Неповторяющиеся элементы списка: ', lst3,
      '\n Элементы которые не имеют повторений', lst2)


